In [6]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
pd.DataFrame(data)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [10]:
# viewing head of dataframe
df_data.head(1)

    Name  Age      City
0  Alice   25  New York

In [9]:
# viewing tail of dataframe
df_data.tail(1)

      Name  Age     City
2  Charlie   35  Chicago

In [12]:
# Viewing the index of the DataFrame
df_data.index

RangeIndex(start=0, stop=3, step=1)

In [13]:
# Viewing only the first column
df_data['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [16]:
# Viewing only the first row
df_data.iloc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [17]:
# Creating the DataFrame using a list of lists
data_list = [
    ['Alice', 25, 'New York'],
    ['Bob', 30, 'Los Angeles'],
    ['Charlie', 35, 'Chicago']
]

df_list = pd.DataFrame(data_list, columns=['Name', 'Age', 'City'])
df_list

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [21]:
 #Writing the DataFrame to a CSV file
df_data.to_csv('my_dataframe.csv', index=False)

1. What does the "write/render/evaluate" loop provide for creators of interactive data visualizations?
  The write/render/evaluate loop allows interactive data visualization artists to iteratively construct, modify, and improve their representations.       Creators can make real-time alterations to their visuals by writing the code, rendering it, and assessing the results.

2. Why are dynamic, interactive data visualizations useful when communicating data?   Dynamic, interactive data visualizations are important because they enable users to interact with data in meaningful ways, examine various elements,    and get insights that static charts may not provide. They improve data storytelling by making information easier to acquire and understand for a        wide range of consumers.

3. Do you agree with Murray's claim that open-source tools that avoid proprietary software are best for publishing data visualization? In a few            sentences, explain why you do or do not agree.
   Yes, I agree with Murray's assertion that open-source technologies are frequently superior for presenting data visualizations. Here's why, in simple    terms as 
Open-source tools are free, making them available to anybody. They also let users to quickly share their work without regard for softwar     e licenses or restrictions. This openness promotes collaboration, innovation, and transparency, allowing people to learn from and enhance each other'   s work. In contrast, proprietary software can be pricey, has limited sharing capabilities, and frequently locks users into specific platforms o         r format

Using open-source tools makes data visualizations more publicly available and allows them to be freely shared or modified, which        is especially essential in industries where openness is prized, such as research, education, and media.